<!-- dflook/terraform-github-actions {"workspace":"auto-vars-2","backend_type":"remote","backend":"3b891f9ea9eac8c02efc28fe0c35144e9d4f8e52953cb60037150f2f086f6c4a","plan_job_ref":"Job Test Terraform cloud #323 at https://github.com/dflook/terraform-github-actions/actions/runs/15329068872","plan_hash":"06572dfb282bfca879e6675d083c1b20c5e2e10dcaa72bebd6adf6a94bc5b717","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __auto-vars-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test Terraform cloud #323](https://github.com/dflook/terraform-github-actions/actions/runs/15329068872)